## 1. Data Aggregation
- Data Aggregation refers to identifying data satisfying a condition.
- It helps in studying one or more aggregated groups together

In [11]:
import pandas as pd
import numpy as np
from urllib import request
myurl='http://aima.cs.berkeley.edu/data/iris.csv'
urlRequest= request.Request(myurl)
iris_file=request.urlopen(urlRequest)

In [12]:
df =pd.read_csv(iris_file,sep=',',header=None,
                decimal='.',
                names=['sepal_length','sepal_width','petal_length','petal_Width','target']
                        )
print(df)

     sepal_length  sepal_width  petal_length  petal_Width     target
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
9             4.9          3.1           1.5          0.1     setosa
10            5.4          3.7           1.5          0.2     setosa
11            4.8          3.4           1.6          0.2     setosa
12            4.8          3.0           1.4          0.1     setosa
13            4.3          3.0           1.1          0.1     setosa
14            5.8          4.0           1.2          0.2     setosa
15            5.7          4.4           1.5          0.4     setosa
16            5.4          3.9           1.3          0.4     setosa
17            5.1          3.5           1.4          0.3     setosa
18            5.7          3.8           1.7          0.3     setosa
19            5.1          3.8           1.5          0.3     setosa
20            5.4          3.4           1.7          0.2     setosa
21            5.1          3.7           1.5          0.4     setosa
22            4.6          3.6           1.0          0.2     setosa
23            5.1          3.3           1.7          0.5     setosa
24            4.8          3.4           1.9          0.2     setosa
25            5.0          3.0           1.6          0.2     setosa
26            5.0          3.4           1.6          0.4     setosa
27            5.2          3.5           1.5          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
..            ...          ...           ...          ...        ...
120           6.9          3.2           5.7          2.3  virginica
121           5.6          2.8           4.9          2.0  virginica
122           7.7          2.8           6.7          2.0  virginica
123           6.3          2.7           4.9          1.8  virginica
124           6.7          3.3           5.7          2.1  virginica
125           7.2          3.2           6.0          1.8  virginica
126           6.2          2.8           4.8          1.8  virginica
127           6.1          3.0           4.9          1.8  virginica
128           6.4          2.8           5.6          2.1  virginica
129           7.2          3.0           5.8          1.6  virginica
130           7.4          2.8           6.1          1.9  virginica
131           7.9          3.8           6.4          2.0  virginica
132           6.4          2.8           5.6          2.2  virginica
133           6.3          2.8           5.1          1.5  virginica
134           6.1          2.6           5.6          1.4  virginica
135           7.7          3.0           6.1          2.3  virginica
136           6.3          3.4           5.6          2.4  virginica
137           6.4          3.1           5.5          1.8  virginica
138           6.0          3.0           4.8          1.8  virginica
139           6.9          3.1           5.4          2.1  virginica
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [13]:
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(150, 5)

in above we have total 5 columns, of 5 - 4 are **features or attributes**  
and the last one is **target** as the data belongs to it

##### to know the different values in  target..called **classes**..lets apply set

In [16]:
set(df['target'])

{'setosa', 'versicolor', 'virginica'}

we have total 3 classes for Target - 'setosa', 'versicolor', 'virginica'

##### lets see the total records
- 3 ways

In [21]:
print(df.shape) # gives both rows and columns
print(df.shape[0])#gives rows
print(df.shape[1])#gives columns
print(df.count()) # each column, count
print(df['target'].count()) # each column, count

(150, 5)
150
5
sepal_length    150
sepal_width     150
petal_length    150
petal_Width     150
target          150
dtype: int64
150

##### lets get only setosa columns  - by boolean masking

In [24]:
df['target']=='setosa'

0       True
1       True
2       True
3       True
4       True
5       True
6       True
7       True
8       True
9       True
10      True
11      True
12      True
13      True
14      True
15      True
16      True
17      True
18      True
19      True
20      True
21      True
22      True
23      True
24      True
25      True
26      True
27      True
28      True
29      True
       ...
120    False
121    False
122    False
123    False
124    False
125    False
126    False
127    False
128    False
129    False
130    False
131    False
132    False
133    False
134    False
135    False
136    False
137    False
138    False
139    False
140    False
141    False
142    False
143    False
144    False
145    False
146    False
147    False
148    False
149    False
Name: target, Length: 150, dtype: bool

In [29]:
df_2=df[df['target']=='setosa']
df_2.count() # we got 50 for target so all columns 50

sepal_length    50
sepal_width     50
petal_length    50
petal_Width     50
target          50
dtype: int64

##### lets get the mean,min,max,std length

In [34]:
print(df_2['sepal_length'].mean())
print(df_2['sepal_length'].min())
print(df_2['sepal_length'].max())
print(df_2['sepal_length'].std())
print(df_2['sepal_length'].median())

5.005999999999999
4.3
5.8
0.3524896872134512
5.0

In [33]:
#or all
df_2.describe()

       sepal_length  sepal_width  petal_length  petal_Width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

## 2.Data Transformation

In [37]:
df = pd.DataFrame({'temp':pd.Series(28 + 10*np.random.randn(10)),

                   'rain':pd.Series(100 + 50*np.random.randn(10)),

                   'location':list('AAAAABBBBB')

})

print(df)

  location        rain       temp
0        A   50.271035  27.735242
1        A  112.134255  19.980076
2        A   81.872100  23.903548
3        A  106.434611  29.982170
4        A  148.884689  21.126927
5        B   87.323570  48.788428
6        B  128.206311  40.236515
7        B  122.665981  43.984229
8        B   62.086830  29.511422
9        B  180.580154  18.589263

##### lets replace location names from A,B to mumbai, Hyderabad

In [39]:
replacements = {
'location': {'A':'Hyderabad', 'B':'Mumbai'}
}

df = df.replace(replacements, regex=True)
print(df.head(2))

    location        rain       temp
0  Hyderabad   50.271035  27.735242
1  Hyderabad  112.134255  19.980076

##### It is also possible to filter rows, based on a column strings with a specific pattern and modify them.

In [40]:
mumbai_data = df.loc[df.location.str.contains('umb'),:]

print(mumbai_data.head(2))

  location        rain       temp
5   Mumbai   87.323570  48.788428
6   Mumbai  128.206311  40.236515

##### similarly many operations can be done columns having string like data

In [42]:
hyd_data = df.loc[df.location.str.endswith('bad'),:]

print(hyd_data.head(2))

    location        rain       temp
0  Hyderabad   50.271035  27.735242
1  Hyderabad  112.134255  19.980076

## Grouping
one or more of the following steps:
- Splitting the data into groups based on some criteria
- Applying a function to each group independently
- Combining the results into a data structure

**GroupBy in Pandas work similar to sql**

for the above

In [44]:
regions = df.groupby('location')
print(regions.mean())

                 rain       temp
location
Hyderabad   99.919338  24.545593
Mumbai     116.172569  36.221971

In [1]:
import pandas as pd
import numpy as np

In [2]:
file_name_string = 'C:/Users/Charles Kelly/Desktop/Exercise Files/02_07/Begin/EmployeesWithGrades.xlsx'
employees_df = pd.read_excel(file_name_string, 'Sheet1', index_col=None, na_values=['NA'])

In [3]:
employees_df

     Department      Name  YearsOfService Grade
0     Marketing      Able               4     a
1   Engineering     Baker               7     b
2    Accounting   Charlie              12     c
3     Marketing     Delta               1     d
4   Engineering      Echo              15     f
5    Accounting   Foxtrot               9     a
6     Marketing      Golf               3     b
7   Engineering     Hotel               1     c
8    Accounting     India               2     d
9     Marketing    Juliet               5     f
10  Engineering      Kilo               7     a
11   Accounting      Lima              11     b
12    Marketing      Mike               2     c
13  Engineering  November               3     d
14   Accounting     Oscar               4     f
15    Marketing      Papa               9     a
16  Engineering    Quebec               1     b
17   Accounting     Romeo               1     c
18    Marketing    Sierra               1     d
19  Engineering     Tango               7     f
20   Accounting   Uniform               5     a
21    Marketing    Victor              19     b
22  Engineering   Whiskey               2     c
23   Accounting      Xray               3     d
24    Marketing    Yankee               8     f
25  Engineering      Zulu              17     a

### group by Department
documentation: http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html

calculate total years of service by employees in each department

In [4]:
employees_df.groupby('Department').sum()

             YearsOfService
Department
Accounting               47
Engineering              60
Marketing                52